{
	"type":"origins:active_self",
	"key":"key.origins.primary_active",
	"entity_action":{
		"type":"origins:and",
		"actions":[
			{
				"type":"origins:execute_command",
				"command":"give @p written_book{pages:[\\'{\"text\":\"Welcome to the Light Mage Origin!          There are some hidden spells, but they require specific items in your offhand to be cast.  You can also make mana potions to store extra mana. (Use spells with [Primary] + [Shift])\"}\\',\\'{\"text\":\"Mana Potions: You can drink mana potions to refill your mana, there are 2 types of mana potions: the basic mana potion and the super mana potion. Basic Potion: Honey Bottle in your offhand. (100 mana)     Super Potion: Dragon Breath in your offhand. (250 mana)\"}','{\"text\":\"First Hidden Spell:      Illumine: Apply Glowing to all entities in a 50 block radius and Night Vision to those in an 8 block radius.            Item: Glowstone Dust in your offhand.\"}','{\"text\":\"Second Hidden Spell:  Blessing of the Sea: Apply Water Breathing to all players within a 6 block radius (including yourself).                  Item: Heart of the Sea in your offhand.\"}','{\"text\":\"Third Hidden Spell: Devour: You can summon evoker fangs! Be careful because they can damage you too!                    Item: Totem of Undying in your offhand.\"}','{\"text\":\"Fourth Hidden Spell: Fluctuate: You can use this spell to send all entities within 6 blocks (including yourself) into the sky. You will also receive Slow Falling.                     Item: Feather in your offhand.\"}','{\"text\":\"Fifth Hidden Spell: Extinguish: You can give fire resistance to you and anyone in a 6 blocks radius. Item: Magma Cream in your offhand.\"}','{\"text\":\"Sixth Hidden Spell:  Bolt: You can summon lightning wherever you want. (Though you need to be exposed to the sky).                  Item: Nether Star in your offhand.\"}','{\"text\":\"Seventh Hidden Spell: Fireball: You can summon a motionless fireball.               Item: Blaze Rod in your offhand.\"}','{\"text\":\"Eighth Hidden Spell: Army: You can summon several snow golems.                Item: Carved Pumpkin in your offhand.\"}','{\"text\":\"Ninth Hidden Spell: Experience: You can exchange quartz for experience.                      Item: Quartz in your offhand.\"}','{\"text\":\"Tenth Hidden Spell: Repulsion: Anyone who attacks you will be pushed away. (Passive) Item: End Crystal in your offhand.\"}','{\"text\":\"Eleventh Hidden Spell:  Leap: You can use this spell to leap in the air.                      Item: Rabbit foot in your offhand.\"}','{\"text\":\"Twelfth Hidden Spell: Shield Sentinel:      You can summon two sentries to protect you, they will attack anything that moves.    Item: Shield on your offhand.\"}','{\"text\":\"Thirteenth Hidden Spell:             Firework Magic: You can summon a firework explosion wherever you want.             Item: Firework Star in your offhand.\"}','{\"text\":\"Fourteenth Hidden Spell:                 Poison Garden: You can summon a poison garden that will trap your enemies wherever you want.     Item: Flowering Azalea in your offhand.\"}','{\"text\":\"Fifteenth Hidden Spell: Accelerate: Apply Speed and Haste to all entities within a 6 block radius.      Item: Clock in your offhand.\"}','{\"text\":\Sixteenth Hidden Spell: Lava Vision: Be able to see better in lava. (Passive) Item: Magma Cream on your offhand.\"}','{\"text\":\"Last Hidden Spell:  Pocket Dimension: This spell will replace all the basic spells.  (Item: Lodestone on your offhand) Press [Load Toolbar Activator] to create and reset your pocket dimension, be aware that everything will be DESTROYED IF YOU RESET IT!\"}','{\"text\":\"Keys: [Primary] to go, [Secondary] to. Use [Primary + Shift] to bring an entity within 3 blocks with you and [Secondary + shift] to bring back an entity within 3 blocks.\"}',],title:MageBook,author:Light Mage}",
				"permission_level":4
			},
			{
				"type":"origins:execute_command",
				"command":"clear @s minecraft:book 1",
				"permission_level":4
			},
			{
				"type":"origins:execute_command",
				"command":"particle minecraft:enchant ~ ~ ~ 2 2 2 2 1000",
				"permission_level":4
			},
			{
				"type":"origins:execute_command",
				"command":"particle minecraft:enchanted_hit ~ ~ ~ 3 3 3 3 1000",
				"permission_level":4
			},
			{
				"type":"origins:execute_command",
				"command":"playsound minecraft:block.note_block.iron_xylophone player @a[distance=..20] ~ ~ ~ 100 0.9 1",
				"permission_level":4
			}
		]
	},
	"condition":{
		"type":"origins:and",
		"conditions":[
			{
				"type":"origins:sneaking"
			},
			{
				"type":"origins:equipped_item",
				"equipment_slot":"offhand",
				"item_condition":{
					"type":"origins:ingredient",
					"ingredient":{
						"item":"minecraft:book"
					}
				}
			}
		]
	}
}