{
	"name": "Hidden Knowledge",
	"description": "You can turn a book into a Mage Book using Shift + Primary with a book on your offhand.",
	"type": "origins:active_self",
	"entity_action": {
    "type": "origins:and",
    "actions": [
	{
			    "type": "origins:change_resource",
                "resource": "origins-plus-plus:white-mage/resource",
                "change": -15
	},
	{
                "type": "origins:execute_command",
                "command": "give @p written_book{pages:['{\"text\":\"Welcome to the White Mage Origin!          There are some hidden spells but they require specific items on your offhand, these spells will replace the clear spell, you can also make potions. (Shift+Primary to use)\"}','{\"text\":\"Mana Potions: You can drink mana potions to regen mana, there are 2 types of mana potions, the basic and the super mana potion. Basic Potion: Press Shift+Primary with Honey Bottle on your offhand. (100)     Super Potion: Press Shift+Primary with Dragon Breath on your offhand. (250)\"}','{\"text\":\"Teams: You have your own team in order to add or remove someone use a wooden sword on your offhand, press primary+shift to add or secondary+shift to remove.(Only works on players,need to be 1..6 blocks away from you)\"}','{\"text\":\"First Hidden Spell:      Illumine: You can use this spell do give the glow effect to any entity in a 50 block radius and night vision for anyone in a 8 block radius!            Item: Glowstone Dust on your offhand.\"}','{\"text\":\"Second Hidden Spell:  Blessing of the sea: You can use this spell to give water breathing to you and anyone in a 6 blocks radius.                  Item: Heart of the sea on your offhand.\"}','{\"text\":\"Third Hidden Spell: Devour: You can summon evoker fangs! Be careful because they can damage you too!                    Item: Totem of Undying on your offhand.\"}','{\"text\":\"Fourth Hidden Spell: Fluctuate: You can use this spell to send you and anyone in a 6 blocks radius to the sky but dont worry you will get slow falling!                     Item: Feather on your offhand.\"}','{\"text\":\"Fifth Hidden Spell: Extinguish: You can give fire resistance to you and anyone in a 6 blocks radius. Item: Magma Cream on your offhand.\"}','{\"text\":\"Sixth Hidden Spell:  Bolt: You can summon lightning wherever you want.(You need to be exposed to the sky).                  Item: Nether Star on your offhand.\"}','{\"text\":\"Seventh Hidden Spell: Fireball: You can summon a motionless fireball.               Item: Blaze Rod on your offhand.\"}','{\"text\":\"Eighth Hidden Spell: Army: You can summon an army of snow golems.                Item: Carved Pumpkin on your offhand.\"}','{\"text\":\"Ninth Hidden Spell: Experience: You can exchange quartz for experience.          (The Quartz needs to be on your offhand, will consume the quartz)\"}','{\"text\":\"Tenth Hidden Spell: Repulsion: Anyone who attacks you will be thrown away. (Passive) Item: End Crystal on your offhand.\"}','{\"text\":\"Eleventh Hidden Spell:  Leap: You can use this spell to leap in the air.                      Item: Rabbit foot on your offhand.\"}','{\"text\":\"Twelfth Hidden Spell: Shield Sentinel:      You can summon two sentries to protect you, they will attack anything that moves.    Item: Shield on your offhand.\"}','{\"text\":\"Thirteenth Hidden Spell:             Firework Magic: You can summon a firework explosion wherever you want.             Item: Firework Star on your offhand.\"}','{\"text\":\"Fourteenth Hidden Spell:                 Poison Garden: You can summon a poison garden that will trap your enemies wherever you want.     Item:Flowering Azalea on your offhand.\"}','{\"text\":\"Fifteenth Hidden Spell: Accelerate: You give speed and haste to you and anyone in a 6 blocks radius.      Item: Clock on your offhand.\"}','{\"text\":\"Last Hidden Spell:  Pocket Dimension: This spell will replace all the basic spells.  (Item: Lodestone on your offhand) Press [Load Toolbar Activator] to create and reset your pocket dimension, be aware that everything will be DESTROYED IF YOU RESET IT!\"}','{\"text\":\"Keys: Primary to go alone. Secondary to go back.         Primary + Shift to bring a entity with you. (3 Blocks) Secondary + shift to bring back a entity with you. (3 Blocks)                Warning! It is recommended that you remove the loadtoolbar key!\"}','{\"text\":\"Ultimate Spells: There are endgame spells that are really powerful but use 99% of your mana, you will need a dragon head on your offhand. (Ultimate Allay, Ultimate Diminish, Ultimate Army)\"}',],title:MageBook,author:WhiteMage}",
                "permission_level": 4
	},
	{
                "type": "origins:execute_command",
                "command": "clear @s minecraft:book 1",
                "permission_level": 4
	},
	{
                "type": "origins:execute_command",
                "command": "particle minecraft:enchant ~ ~ ~ 2 2 2 2 1000",
                "permission_level": 4
	},
	{
                "type": "origins:execute_command",
                "command": "particle minecraft:enchanted_hit ~ ~ ~ 3 3 3 3 1000",
                "permission_level": 4
	},
	{
                "type": "origins:execute_command",
                "command": "playsound minecraft:block.note_block.iron_xylophone player @a[distance=..20] ~ ~ ~ 100 0.9 1",
                "permission_level": 4
	}
	]
	},
	"cooldown": 0,
	"key": {
		"key": "key.origins.primary_active",
		"continuous": false
	},
	"condition": {
		"type": "origins:and",
		"conditions": [{
		 "type": "origins:sneaking",
		 "inverted": false
	},
	{
		"type": "origins:equipped_item",
        "equipment_slot": "offhand",
        "item_condition": {
			"type": "origins:ingredient",
			"ingredient": {
            "item": "minecraft:book"
              }
          }
	}
	]
	},
	"hud_render": {
		"should_render": false,
		"bar_index": 0
	}
}